mas = [["0","X","0"], ['X', 'X', '-'], ['X', 'X', '-']]
def check_win(mas):
    if any([all([mas[0][0] == "X", mas[0][1] == "X", mas[0][2] == "X"]),
            all([mas[1][0] == "X", mas[1][1] == "X", mas[1][2] == "X"]),
            all([mas[2][0] == "X", mas[2][1] == "X", mas[2][2] == "X"]),
            all([mas[0][0] == "X", mas[1][0] == "X", mas[2][0] == "X"]),
            all([mas[0][1] == "X", mas[1][1] == "X", mas[2][1] == "X"]),
            all([mas[0][2] == "X", mas[1][2] == "X", mas[2][2] == "X"]),
            all([mas[0][0] == "X", mas[1][1] == "X", mas[2][2] == "X"]),
            all([mas[0][2] == "X", mas[1][1] == "X", mas[2][0] == "X"]),

            ]):
        print("Победил Х! Поздравляем!")
        return "X"
        draw_table()
    elif any([all([mas[0][0] == "0", mas[0][1] == "0", mas[0][2] == "0"]),
              all([mas[1][0] == "0", mas[1][1] == "0", mas[1][2] == "0"]),
              all([mas[2][0] == "0", mas[2][1] == "0", mas[2][2] == "0"]),
              all([mas[0][0] == "0", mas[1][0] == "0", mas[2][0] == "0"]),
              all([mas[0][1] == "0", mas[1][1] == "0", mas[2][1] == "0"]),
              all([mas[0][2] == "0", mas[1][2] == "0", mas[2][2] == "0"]),
              all([mas[0][0] == "0", mas[1][1] == "0", mas[2][2] == "0"]),
              all([mas[0][2] == "0", mas[1][1] == "0", mas[2][0] == "0"]),
              ]):
        print("Победил 0! Поздравляем!")
        return 0
        draw_table()

check_win(mas)